var articles = [
  const Article(
    title:
        "どこよりも詳しいGinger Root [3] ：実はVulfpeckの大ファン！Ginger RootがVulfpeckから受けた影響まとめ",
    content: '''
KINZTOのDr.ファンクシッテルーです。今回の記事は、連載全3回の最終回となります。1回目と2回目の記事はこちらからご覧ください。👇
今回の記事は、Ginger Root（ジンジャー・ルート）が、Vulfpeck（ヴォルフペック）からどんな影響を受けていたのか？という記事です。これについてまとめあげている記事は、現時点で他に存在しません。
Vulfpeckって何？という方は、私のnoteマガジンか、私の著書を読んでいただければ理解できるはず。どちらも完全無料です。👇
    ''',
  ),
  const Article(
    title: "どこよりも詳しいGinger Root [2] ：来日前の大特集！音楽と映像をひとりで作り上げる、稀代のアーティストを完全解説・後編",
    content: '''
（この記事は後半です。前半を読みたい方はこちらから👇）
【前回までのあらすじ】
大学で映像制作を学びながらも、卒業後はミュージシャンとして活動することにしたGinger Root。インディーズ時代に終わりを告げ、いよいよレコード会社と契約します！
    ''',
  ),
  const Article(
    title: "どこよりも詳しいGinger Root [1] ：来日前の大特集！音楽と映像をひとりで作り上げる、稀代のアーティストを完全解説・前半",
    content: '''
KINZTOのDr.ファンクシッテルーです。今回は、いま日本で話題になっている新しいアーティスト、Ginger Root（ジンジャー・ルート）について、どこよりも詳しい紹介をしていきたいと思います。
（この記事は前半です。後半を読みたい方はこちらから👇）
Ginger Rootはカリフォルニア州出身のシンガーソングライターですが、👆の動画を観てもらえば分かる通り、まるで80年代のシティポップのような曲を、山下達郎のような風貌で歌いあげています。
    ''',
  ),
  const Article(
    title:
        "『THE FEARLESS FLYERS 解体新書』(1)どこよりも詳しいフィアレス・フライヤーズーー僕らの3度目のライブ会場は、マディソン・スクエア・ガーデンだった",
    content: '''
KINZTOのDr.ファンクシッテルーだ。今回は「どこよりも詳しいVulfpeckまとめ」マガジンの、30回目の連載になる。では、講義をはじめよう。
今回は――フィアレス・フライヤーズ（THE FEARLESS FLYERS）について、どこよりも詳しく解説していく。
全2回の更新、今回はバンドのメンバーやサウンド、ライブについて。次回は全アルバムや、動画の解説を行う。
    ''',
  ),
  const Article(
    title:
        "『THE FEARLESS FLYERS 解体新書』(1)どこよりも詳しいフィアレス・フライヤーズーー僕らの3度目のライブ会場は、マディソン・スクエア・ガーデンだった",
    content: '''
KINZTOのDr.ファンクシッテルーだ。今回は「どこよりも詳しいVulfpeckまとめ」マガジンの、30回目の連載になる。では、講義をはじめよう。
今回は――フィアレス・フライヤーズ（THE FEARLESS FLYERS）について、どこよりも詳しく解説していく。
全2回の更新、今回はバンドのメンバーやサウンド、ライブについて。次回は全アルバムや、動画の解説を行う。
    ''',
  ),
  const Article(
    title: "ヨルシカのインスト曲について。",
    content: '''
最近ヨルシカをよく聴く。
大概の若者と一緒。
ヨルシカは、
現代人の夜志向を歌っていると言われる。
いわゆる、夜好性と呼ばれるものだ。
喪失と逃亡を焦点に、歌詞が回っていく。
喪失と逃亡を称賛するようなヨルシカの歌詞を聞くとき、
現代人はその心地よさに、身を浸している。
    ''',
  ),
  const Article(
    title: "文芸翻訳に出会う前まで③",
    content: '''
私が文芸翻訳を勉強したいと思い、迷わずSOAS（ロンドン大学東洋アフリカ研究学院）を選んだ理由は、最初にお話を聞きに行った佐藤＝ロスベアグ・ナナ先生に、「翻訳とは研究です」と言い切られたことだった。
ロンドンに来て間もない頃、文芸翻訳、という選択肢がぼんやり頭にありつつも、まだ現実味のなかった頃に、私は一冊の本に出会っていた。「星の王子さま」という日本語を生み出したフランス文学者、内藤濯（あろう）氏のエッセイだ。タイトルは、『星の王子とわたし』だった。
    ''',
  ),
];

class Article {
  final String title;
  final String content;

  const Article({required this.title, required this.content});
}
